#+TITLE: Design Space Exploration for High Performance Computing
#+AUTHOR: @@latex: \footnotesize Pedro Bruel, Sitao Huang, Vipin Kumar Kukkala, Sai Rahul Chalamalasetti, Cong Xu, Daniel Dauwe, Darel Emmot, \mbox{Ryan Menhusen}, \mbox{Dejan Milojicic}, \mbox{Alfredo Goldman}@@
#+EMAIL:     phrb@ime.usp.br
#+DATE:      @@latex: \scriptsize July 31, 2020@@
#+DESCRIPTION:
#+KEYWORDS:
#+LANGUAGE:  en
#+OPTIONS:   H:2 num:t toc:nil @:t \n:nil ::t |:t ^:t -:t f:t *:t <:t
#+OPTIONS:   tex:t latex:t skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+LINK_UP:
#+LINK_HOME:

#+STARTUP: beamer
#+LATEX_CLASS: beamer
#+LATEX_CLASS_OPTIONS: [10pt, compress, aspectratio=169, xcolor={table,usenames,dvipsnames}]
#+LATEX_HEADER: \mode<beamer>{\usetheme[numbering=fraction, progressbar=none, titleformat=smallcaps, sectionpage=none]{metropolis}}

#+COLUMNS: %40ITEM %10BEAMER_env(Env) %9BEAMER_envargs(Env Args) %4BEAMER_col(Col) %10BEAMER_extra(Extra)

#+LATEX_HEADER: \usepackage{sourcecodepro}
#+LATEX_HEADER: \usepackage{booktabs}
#+LATEX_HEADER: \usepackage{array}
#+LATEX_HEADER: \usepackage{listings}
#+LATEX_HEADER: \usepackage{multirow}
#+LATEX_HEADER: \usepackage{caption}
#+LATEX_HEADER: \usepackage{xeCJK}
#+LATEX_HEADER: \usepackage{graphicx}
#+LATEX_HEADER: \usepackage[english]{babel}
#+LATEX_HEADER: \usepackage[scale=2]{ccicons}
#+LATEX_HEADER: \usepackage{hyperref}
# #+LATEX_HEADER: \usepackage{url}
#+LATEX_HEADER: \usepackage{relsize}
#+LATEX_HEADER: \usepackage{amsmath}
#+LATEX_HEADER: \usepackage{bm}
#+LATEX_HEADER: \usepackage{wasysym}
#+LATEX_HEADER: \usepackage{ragged2e}
#+LATEX_HEADER: \usepackage{textcomp}
#+LATEX_HEADER: \usepackage{pgfplots}
#+LATEX_HEADER: \usepackage{appendixnumberbeamer}
#+LATEX_HEADER: \usepgfplotslibrary{dateplot}
#+LATEX_HEADER: \definecolor{Base}{HTML}{191F26}
#+LATEX_HEADER: \definecolor{Highlight}{HTML}{ffda99}
# #+LATEX_HEADER: \definecolor{Accent}{HTML}{157FFF}
*** Load Data
    #+begin_SRC R :results output :session *R* :eval no-export :exports results
    library(dplyr)
    df_freq <- read.csv("../data/wiki_data/frequency.csv", header = TRUE)
    df_transistor <- read.csv("../data/wiki_data/transistor_count.csv", header = TRUE)
    #+end_SRC

    #+RESULTS:
    #+begin_example

    Attaching package: ‘dplyr’

    The following objects are masked from ‘package:stats’:

        filter, lag

    The following objects are masked from ‘package:base’:

        intersect, setdiff, setequal, union
    #+end_example

    #+begin_SRC R :results output :session *R* :eval no-export :exports results
    str(df_freq)
    #+end_SRC

    #+RESULTS:
    #+begin_example
    'data.frame':	199 obs. of  12 variables:
     $ date               : int  1971 1972 1972 1972 1972 1973 1973 1973 1974 1974 ...
     $ name               : chr  "4004" "PPS-25" "μPD700" "8008" ...
     $ designer           : chr  "Intel" "Fairchild" "NEC" "Intel" ...
     $ max_clock_khz      : int  740 400 NA 500 200 NA NA NA 715 NA ...
     $ max_clock_mhz      : num  NA NA NA NA NA 2 1 1 NA 2 ...
     $ max_clock_ghz      : num  NA NA NA NA NA NA NA NA NA NA ...
     $ process_micro_m    : num  10 NA NA 10 NA 7.5 6 NA NA 6 ...
     $ process_nm         : int  NA NA NA NA NA NA NA NA NA NA ...
     $ chips              : int  1 2 1 1 1 1 1 1 3 1 ...
     $ transistor_count   : int  2250 NA NA 3500 NA 2500 2800 NA NA 6000 ...
     $ transistor_millions: num  NA NA NA NA NA NA NA NA NA NA ...
     $ logical_cores      : int  1 1 1 1 1 1 1 1 1 1 ...
    #+end_example

    #+begin_SRC R :results output :session *R* :eval no-export :exports results
    str(df_transistor)
    #+end_SRC

    #+RESULTS:
    : 'data.frame':	151 obs. of  6 variables:
    :  $ name            : chr  "Intel 4004 " "Intel 8008 " "Toshiba TLCS-12 " "Intel 4040 " ...
    :  $ transistor_count: num  2250 3500 11000 3000 4100 ...
    :  $ date            : int  1971 1972 1973 1974 1974 1974 1974 1975 1976 1976 ...
    :  $ designer        : chr  "Intel" "Intel" "Toshiba" "Intel" ...
    :  $ process_nm      : int  10000 10000 6000 10000 6000 6000 8000 8000 5000 4000 ...
    :  $ area_mm         : num  12 14 32 12 16 20 11 21 27 18 ...

*** Load Data
    #+begin_SRC R :results output :session *R* :eval no-export :exports results
    library(extrafont)

    df_search_spaces <- read.csv("../data/search_spaces/search_spaces.csv")
    #+end_SRC

    #+RESULTS:

    #+begin_SRC R :results output :session *R* :eval no-export :exports results
    str(df_search_spaces)
    #+end_SRC

    #+RESULTS:
    #+begin_example
    'data.frame':	88 obs. of  10 variables:
     $ name                   : chr  "atax" "gemv" "fdtd4d2d" "gemver" ...
     $ year                   : int  2012 2012 2012 2012 2012 2012 2012 2012 2012 2012 ...
     $ dimension              : int  19 49 30 24 11 15 14 12 20 25 ...
     $ search_space_size      : num  1.65e+14 2.73e+30 7.06e+24 7.26e+17 1.56e+08 ...
     $ log10_search_space_size: int  14 30 24 17 8 8 12 8 16 19 ...
     $ domain                 : chr  "Linear Algebra" "Linear Algebra" "Linear Algebra" "Linear Algebra" ...
     $ author                 : chr  "Balaprakash, P. et al. (2012)" "Balaprakash, P. et al. (2012)" "Balaprakash, P. et al. (2012)" "Balaprakash, P. et al. (2012)" ...
     $ gscholar_citation      : chr  "balaprakash2012spapt" "balaprakash2012spapt" "balaprakash2012spapt" "balaprakash2012spapt" ...
     $ thesis                 : logi  FALSE FALSE FALSE FALSE FALSE FALSE ...
     $ chapter                : logi  NA NA NA NA NA NA ...
    #+end_example
** Classification Tree: Simplest Version
   #+begin_SRC emacs-lisp :eval no-export
   (setq-local org-latex-pdf-process (list "%latex -interaction nonstopmode -output-directory %o %f" "%latex -interaction nonstopmode -output-directory %o %f" "%latex -interaction nonstopmode -output-directory %o %f"))
   (setq org-format-latex-header "\\documentclass{standalone}
   [PACKAGES]
   [DEFAULT-PACKAGES]
   \\pagestyle{empty} % do not remove")
   #+end_SRC

   #+RESULTS:
   : \documentclass{standalone}
   : [PACKAGES]
   : [DEFAULT-PACKAGES]
   : \pagestyle{empty} % do not remove

   #+HEADER: :headers '("\\usepackage[dvipsnames]{xcolor}" "\\usepackage{tikz}" "\\usepackage{forest}" )
   #+HEADER: :exports results :results raw :file ../../../img/simplest_tree.pdf
   #+begin_src latex :eval no-export
   \begin{forest}
     for tree={%
       anchor = north,
       align = center,
       %if n children=0{tier=terminal}{},
       l sep+=1em
     },
     [{Minimize $f: \mathcal{X} \mapsto \mathbb{R}$,\\$Y = f(X = (x_1,\dots,x_k) \in \mathcal{X}) + \varepsilon$},
       draw,
       [{Constructs surrogate\\estimate $\hat{f}(\cdot, \theta(X))$?},
         draw,
         [{Search\\Heuristics},
           draw,
           edge label = {node[midway, fill=white, font = \scriptsize]{No}}
           [{Is $f(X)$ convex?},
             draw
             [{\textbf{Genetic}\\\textbf{Algoritms}},
               draw,
               edge label = {node[midway, fill=white, font = \scriptsize]{No}}]
             [{\textbf{Simulated}\\\textbf{Annealing}},
               draw,
               edge label = {node[midway, fill=white, font = \scriptsize]{Approx.}}]
             [{\textbf{Gradient}\\\textbf{Descent}},
               draw,
               edge label = {node[midway, fill=white, font = \scriptsize]{Yes}}]]]
         [{Statistical\\Learning},
           draw,
           edge label = {node[midway, fill=white, font = \scriptsize]{Yes}}
           [{Parametric\\Learning},
             draw,
             [{Independent\\Distributions\\for $x_i \in X$},
               draw
               [\textbf{Bandit}\\\textbf{Algorithms}, draw]]
             [{Linear Model\\$\hat{f} = \mathcal{M}(X)\theta{}(X) + \varepsilon$},
               draw
               [{\textbf{Experimental}\\\textbf{Design}},
                 draw]]]
           [{Nonparametric\\Learning},
             draw,
             [{\textbf{Decision}\\\textbf{Trees}},
               draw]
             [{\textbf{Gaussian}\\\textbf{Process}\\\textbf{Regression}},
               draw]
             [{\textbf{Neural}\\\textbf{Networks}}, draw]]]]]
   \end{forest}
   #+end_src

   #+RESULTS:
   [[file:../../../img/simplest_tree.pdf]]

